/*----------------------------------------------------------------
 * Алгоритмізація і програмування на мові С.
 * Заняття 10. Типи даних, визначені користувачем (частина 2).
 * Частина 3. Створення нового вузла для списку.
 *----------------------------------------------------------------
 * ITA17
 * Vaskivnyuk Mykhailo
 * 17.06.2017
 *----------------------------------------------------------------
 * IDE: Qt Creator 3.2.1 Основан на Qt 5.3.2 (MSVC 2010, 32 бита)
----------------------------------------------------------------*/

/* ЗАВДАННЯ
Напишіть процедуру, яка створює вузол однозв'язного списку з наступними даними:
- назва футбольного клубу (символьний рядок);
- місто, яке представляє клуб (символьний рядок);
- країна (символьний рядок);
- річний бюджет (млн.$, дійсне число);
- місце в світовому клубному рейтингу (ціле число).
Всі перелічені атрибути мають виступати в якості вхідних параметрів функції.
*/

#include <stdio.h>
#include "clubs.h"

int main(void)
{
    sClubs    * clubs_ptr = NULL;
    sClubNode * club_ptr  = NULL;

    cls_init(&clubs_ptr);
    club_ptr = cls_new("Super Club", "Club City", "Club Country", 100.5, 128);
    cls_add_to_end(clubs_ptr, club_ptr);

    printf("Club Name:    %20s\n",   club_ptr->club_name);
    printf("Club City:    %20s\n",   club_ptr->club_city);
    printf("Club Country: %20s\n",   club_ptr->club_country);
    printf("Club Revenue: %20.2f\n", club_ptr->club_revenue);
    printf("Club Place:   %17d\n",   club_ptr->club_place);

    return 0;
}
