/*----------------------------------------------------------------
 * Алгоритмізація і програмування на мові С.
 * Заняття 5. Символьні рядки.
 * Частина 4. Введення-виведення рядків: функції бібліотеки iostream.
 *----------------------------------------------------------------
 * ITA17
 * Vaskivnyuk Mykhailo
 * 21.05.2017
 *----------------------------------------------------------------
 * IDE: Qt Creator 3.0.0 Основан на Qt 5.2.0 (MSVC 2010, 32 бита)
----------------------------------------------------------------*/

/* ЗАВДАННЯ
Напишіть програму, яка б реалізовувала:
1) введення і виведення деякого рядка (через команди бібліотеки <iostream>
і контролюючи обмеження функцією setw());
2) роботу з рядком за допомогою механізму покажчиків:
  - використовуйте змінну str як покажчик на рядок;
  - виведіть рядок за допомогою циклу по одному символу,
пересуваючи покажчик str кожного разу на наступний символ.
Проаналізуйте результат у випадку, якщо введений рядок буде перевищувати вказане обмеження.
*/

#include <iostream>
#include <iomanip>

using namespace std;

int main()
{
    const int MAX = 10;
    char string[MAX];
    char * str = string;
    int i = 0;

    cout << "Input string: ";
    cin >> setw(MAX) >> str;
    //cin.get(str, MAX);
    cout << "You've input: " << str << endl << endl;

    do
    {
        cout << *str << endl;
    }
    while(*++str);
    cout << endl;

    do
    {
        cout << string[i++] << endl;
    }
    while(string[i]);

    return 0;
}
