/*----------------------------------------------------------------
 * Алгоритмізація і програмування на мові С.
 * Заняття 1. Основи мови С. Частина 1.
 * Частина 16. Підсумкове завдання.
 *----------------------------------------------------------------
 * ITA17
 * Vaskivnyuk Mykhailo
 * 16.05.2017
 *----------------------------------------------------------------
 * IDE: Qt Creator 3.0.0 Основан на Qt 5.2.0 (MSVC 2010, 32 бита)
----------------------------------------------------------------*/

/* ЗАВДАННЯ
Складіть програму, яка б виконувала наступні дії:
1) прийняти з клавіатури два цілих числа (d1 - ділене і d2 - дільник);
2) перевірити їх на коректність: якщо d2==0, або одночасно d1== d2==0 –
 вивести відповідні повідомлення і повторити введення (повернутись на п.1);
3) розрахувати частку і остачу від їх ділення;
4) в залежності від того, чому дорівнює остача – вивести на екран d2 разів частку і в кінці – остачу (один раз) за допомогою різних циклів:
   - якщо остача == 1 – циклу з відомою кількістю повторень (for);
   - якщо остача == 2 – циклу з умовою (while);
   - якщо остача == 3 – циклу з післяумовою (do-while);
   - в іншому випадку – попросити повторно ввести ділене і дільник (перехід на п.1).
*/

#include <stdio.h>

int outFraction(int fraction, int *cycle_type, int cycle_count);

int main(void)
{
    int d1 = 0;
    int d2 = 0;
    int fraction = 0;
    int rest = 0;

    while(1)
    {
        printf("--------------------------------------------\n");
/*----------------------------------------------------------------
        ввід даних з клавіатури
----------------------------------------------------------------*/
        printf("ENTER TWO INTEGER NUMBERS: ");
        d1 = d2 = 0; //якщо scanf отримає не всі аргументи,
                     //то значення змінних залишаться без змін,
                     //тобто не обнуляються
        _flushall(); //очистка буферу вводу,
                     //якщо попередній scanf зчитав не всі дані
        //fflush(stdin); //інший варіант очистки буферу
        scanf("%d%d", &d1, &d2);
        //while(getchar() != '\n'); //ще один варіант очистки буферу
                                    //getchar() != EOF (можливо потрібна і ця умова)
        printf("\n");
        printf("YOUR FIRST NUMBER IS: %d\n", d1);
        printf("YOUR SECOND NUMBER IS: %d (CYCLE COUNT)\n", d2);
/*----------------------------------------------------------------
        перевірка введених даних
----------------------------------------------------------------*/
        if(d2 == 0)
        {
            if(d1 == 0)
                printf("WRONG NUMBERS! THEY SHOULD NOT BE THE ZERO!\n");
            else
                printf("WRONG SECOND NUMBER! IT SHOULD NOT BE THE ZERO!\n");

            printf("TRY AGAIN!\n");
            getch();
            continue;
        }
/*----------------------------------------------------------------
        підрахунок частки та остачі
----------------------------------------------------------------*/
        fraction = d1 / d2;
        rest = d1 % d2;
/*----------------------------------------------------------------
        виведення результату на екран
----------------------------------------------------------------*/
        if(!outFraction(fraction, &rest, d2)) continue; //якщо остача не дорівнює ні 1, ні 2, ні 3
/*----------------------------------------------------------------
        повтор програми після натискання будь-якої клавіші
----------------------------------------------------------------*/
        if(getch() == 'q') break; //натискання клавіші 'q' - вихід з програми
    }

    return 0;
}

/*----------------------------------------------------------------
            ІНШІ ФУНКЦІЇ
----------------------------------------------------------------*/
int outFraction(int fraction, int *cycle_type, int cycle_count)
{
    //cycle_type == rest(остача) - визначає тип циклу;
    //cycle_count - кількість ітерацій циклу;
    //якщо відбувся вивід на екран значення fraction, функція повертає 1, інакше - 0;

    if(cycle_count < 0) cycle_count *= -1; //можлива передача у функцію від'ємного значення

    switch(*cycle_type)
    {
        case 1:
            for(cycle_count; cycle_count; cycle_count--)
                printf("FOR < %d > FRACTION: %d\n", cycle_count, fraction);
            break;
        case 2:
            while(cycle_count--)
                printf("WHILE < %d > FRACTION: %d\n", cycle_count + 1, fraction);
            break;
        case 3:
            do
                printf("DO < %d > FRACTION: %d\n", cycle_count, fraction);
            while(--cycle_count);
            break;
        default:
            printf("REST: %d\n", *cycle_type);
            printf("REST NOT EQUAL NOR 1 NOR 2 NOR 3! TRY AGAIN!\n");
            return 0;
    }

    printf("REST: %d (CYCLE TYPE)\n", *cycle_type);

    return 1;
}
