// Заняття 13.05.17

// Коректна обробка кирилиці
/*
#include <windows.h>

main()
{
	SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
...
}	
*/

// Пріоритети операцій в С/С++
/*
1 рівень: Унарні операції:
		“!” - логічне заперечення (“НЕ”)
		“++” - пре-інкремент (збільшення на 1, пишеься перед назвою комірки)
		“--” - пре-декремент (зменшення на 1, пишеься перед назвою комірки)
2 рівень: Арифметичні мультиплікативні:
		“*” - множення
		“/” - ділення
		“%” - остача від цілочисельного ділення
3 рівень: Арифметичні адитивні:
		“+” - додавання
		“-” - віднімання
4 рівень: Відношення нерівності:
		“>” - більше
		“<” - менше
		“>=” - більше або дорівнює
		“<=” - менше або дорівнює
5 рівень: Відношення рівності:
		“==” - дорівнює
		“!=” - не дорівнює
6 рівень: 	“&&” - логічне “І”
7 рівень: 	“||” - логічне “АБО”
8 рівень: Операції присвоювання:
		“=” - присвоїти
		“+=” - присвоїти з додаванням
		“-=” - присвоїти з відніманням
		“*=” - присвоїти з множенням
		“/=” - присвоїти з діленням
9 рівень: Унарні операції:
		“++” - пост-інкремент (збільшення на 1, пишеься після назвою комірки)
		“--” - пост-декремент (зменшення на 1, пишеься після назвою комірки)
Примітка: операції одного рівня мають однаковий пріоритет.
*/

// Оператори умов (загальна структура)
if ( умова ) // заголовок з умовою
{
... 	// блок «якщо» — оператори, які виконуются,
// якщо умова в заголовку є істинною (виконується)
}
else
{
...  	// блок «інакше» — оператори, які виконуються,
        // якщо умова в заголовку є хибною (не виконується)
}

/*
При описанні умови широко застосовуються знаки логічних відношень:
>, <  - більше, менше;
>=, <= - більше або дорівнює, менше або дорівнює;
== - дорівнює;
!= - не дорівнює.
*/

//Приклад (визначення більшого з двох чисел)
#include <stdio.h>

main()
{
	float A,B, Max; // A і B - числа, що порівнюються, Max - допоміжна змінна
	printf("Input A and B : "); 	// підказка
	scanf ( "%f%f", &A, &B );		// введення чисел з клавіатури
	if ( A > B ) 				// умова
	{   
		Max = A; 
	}
	else
	{
		Max = B; 
	}
	printf ( "Max value is %f", Max ); // вивести на екран змінну Max, яка дорівнює більшому з 2-х введених чисел
	getchar();
}

// принцип "сходинки"
...
if ( score > 65 ){
	if ( score > 90 )
		printf ( "Ви отримали залік автоматично" );

    printf ( "Вам слід пройти складання заліку" );
}
else if (...)
	  printf ( "Ви не допущені до заліку" );
…

// Логічні операції в умові
/*
( умова1 && умова2 ) - операція “І” (істинна лише при виконанні одночасно обох умов);
( умова1 || умова2 ) - операція “АБО” (істинна при виконанні хоча б однієї  умови);
( ! умова ) - операція “НЕ” (заперечення умови) (“істину” змінює на “хибність” і навпаки).
*/

// Приклад
#include <stdio.h>

main()
{
	int age; // ціле число - вік людини
	
	printf ( "\nВкажіть ваш вік: " ); // підказка
	scanf ( "%d", &age );	// введення з клавіатури
	if ( age <= 40 && age >= 25 ) // складна умова
		printf ( "Вітаємо! Вас запрошено на співбесіду" );
	else
		printf ( "Прикро, але Ви перевищили віковий ценз" );
	getch();
}

//Оператор вибору
#include <stdio.h>

main()
{
	char c; // символьна змінна - критерій вибору

	printf("\nВведіть першу літеру:");	// підказка
	scanf("%c", &c); // ввод літери з клавіатури
	switch (c) // заголовок оператора вибору
	{ 		// тіло оператора вибору
		case 'a': printf("\nАвстралія");
				  printf("\nАлбанія");
		          break;// при введенні літери “а”
		case 'б': printf("\nБолгарія"); break; // при введенні літери “б”
		case 'в': printf("\nВенесуела"); break; // при введенні літери “в”
		default: printf("\nВаріанти відсутні"); // в інших випадках
	}
	getchar();
}

...
// дії, що відповідають виконанню кількох умов
case 'а':
case 'А':
	printf("\nАвстралія"); break; // виводимо назву незалежно від регістру введеної першої літери
case 'б':
case 'Б':
	printf("\nБолгарія"); break;
...

// Різновиди циклів
// цикл з відомою кількістю повторень
#include <stdio.h> // підключення стандартних функцій вводу-виводу

main()
{
	int i; // змінна і - “лічильник” циклу (тип int - ціле число)
	
	for (i=1;i<=10;i*=4) // заголовок циклу
	// for ( int i = 1; i <= 10; i ++ ) - допустимо в С++
	// for (;;;) - варіант "нескінченного" циклу
	{ 				// початок циклу
		
		printf("Слава Україні! Героям слава!"); // тіло циклу - виведення на екран тексту в дужках
	} 				// кінець циклу
	getchar(); // функція для затримки програми (очікує натиснення клавіші Enter)
}

// Цикл з умовою
// Приклад (підрахунок кількості цифр в цілому числі)
#include <stdio.h>

main()
{
	int N; // оголошуємо змінну - ціле число (типу int), що вводиться з клавіатури
	int count=0; // змінна-лічильник цифр

	printf ( "\nВведіть число N: " ); // виведення на екран тексту-підказки
	scanf ( "%d", &N ); // вводимо число N з клавіатури
	while ( N > 0) // заголовок циклу (буде виконуватись, поки N > 0)
	{ 		// початок циклу
		N /= 10; // ділимо число N на 10 (відсікаємо останню цифру)
		count ++; // інкремент лічильника цифр
	}		 // кінець циклу
	printf ( "Це число має %d цифр\n", count );  // вивести на екран текст з результатом
}

// Цикл з післяумовою
// Приклад (знаходження суми цифр числа)
#include <stdio.h>

main()
{
	int N, sum; // цілі числа N і sum - сумма цифр числа N

	sum = 0; // обнуляємо початкову суму
	do { 		// початок циклу
		printf ( "\nВведіть натуральне число:" ); // на екран - текст-підказку
		scanf ( "%d", &N ); // введення числа N з клавіатури
	}	// кінець циклу
	while ( N <= 0 ); 	// умова циклу - поки не введено число, яке більше 0
	while ( N > 0 ) {
		sum += N % 10; // знаходимо остачу від ділення на 10 (останню цифру) і додаємо до попередньої суми
		N /= 10; 	// зменшуємо число в 10 разів
	}
	printf ( "Сума цифр цього числа дорівнює %d\n", sum ); // результат - на екран

}

// Переривання в циклах
// Приклад (обрахунок частки і остачі від ділення 2-х чисел)
#include <stdio.h>

main()
{
	int A, B; 	// цілі числа - ділене і дільник

while (1) 	// “нескінченний” цикл - (1) означає, що умова виконання завжди є істинною!
{
	printf ( "\nВведіть ділене і дільник:" ); // рядок-підказка на екран
	scanf ( "%d%d", &A, &B );	// введення діленого і дільника з клавіатури
	if ( A == 0 && B == 0 ) break; // вихід з циклу за командою break, якщо обидва введені числа дорівнюють 0
	if ( B == 0 ) {		// якщо дільник (знаменник) дорівнює 0 -
		printf ( "Ділення на нуль" ); // повідомлення про помилку
		continue;	// достроковий перехід на новий крок циклу
	}
	printf ( "Частка - %d остача - %d", A/B, A%B ); // результат - на екран
}

}