#include <stdio.h>

typedef
int (*fp)   (            );

int   f1    (            ){ return 5; }
int   f2    (int a       ){ return a; }
int   f3    (int a, int b){ return a + b; }

int  parManyFunc(int, ...);

int main(void)
{
    fp func_ptr = NULL;
//-----------------------------------------------------------------------------
//  тест вказівника на функції з різною кількістю параметрів
//-----------------------------------------------------------------------------
    func_ptr = f1;
    printf("%d\n", func_ptr());
    func_ptr = f2;
    printf("%d\n", func_ptr(10));
    func_ptr = f3;
    printf("%d\n", func_ptr(10, 10));
//-----------------------------------------------------------------------------
//  тест функції з різною кількістю параметрів
//-----------------------------------------------------------------------------
    puts("\0");
    parManyFunc(5, 15, 14, 13, 12, 11);

    func_ptr = parManyFunc; //видає попередження
    puts("\0");
    func_ptr(5, 15, 14, 13, 12, 11);
//-----------------------------------------------------------------------------
    return 0;
}

int parManyFunc(int n, ...)
{
    int * par_ptr = &n;
    int i = 0;

    for(i = 0; i < n; i++)
        printf("%d\n", *++par_ptr);

    return 0;
}
