/*----------------------------------------------------------------
 * Алгоритмізація і програмування на мові С.
 * Заняття 5. Символьні рядки.
 * Частина 3. Введення-виведення рядків: функції бібліотеки stdio.h.
 *----------------------------------------------------------------
 * ITA17
 * Vaskivnyuk Mykhailo
 * 21.05.2017
 *----------------------------------------------------------------
 * IDE: Qt Creator 3.0.0 Основан на Qt 5.2.0 (MSVC 2010, 32 бита)
----------------------------------------------------------------*/

/* ЗАВДАННЯ
На базі наведеного зразка, складіть програму з наступними особливостями:
1) введіть в явному вигляді покажчик на рядок (типу char);
2) присвойте йому значення str ;
3) за допомогою циклу - виведіть послідовно символи рядка,
пересуваючи введений покажчик на кожен наступний символ.
*/

#include <stdio.h>
#define MAX 80

int main(void)

{
    char str[MAX];
    char *pt = NULL;


    printf("Input string: ");
    scanf("%s", str);
    printf("You've input: %s\n", str);

    pt = str;
    do printf("%c\n", *pt);
    while(*++pt);

    return 0;
}
