/*----------------------------------------------------------------
 * Алгоритмізація і програмування на мові С.
 * Заняття 4. Покажчики та рекурсія.
 * Частина 11. Рекурсивний пошук.
 *----------------------------------------------------------------
 * ITA17
 * Vaskivnyuk Mykhailo
 * 20.05.2017
 *----------------------------------------------------------------
 * IDE: Qt Creator 3.0.0 Основан на Qt 5.2.0 (MSVC 2010, 32 бита)
----------------------------------------------------------------*/

/* ЗАВДАННЯ
Реалізуйте рекурсивну функцію NumNum() для пошуку повторень деякого цілого числа в масиві.
Особливості функції:
1) знаходить номер першої появи потрібного числа в масиві (якщо не знайдено - вихід з функції);
2) повертає значення: 1+<кількість повторень в "недослідженій" частині рядка>; (рекурсивний виклик)
3) параметри функції: номер елемента, наступного за знайденим (при першому виклику з головної програми - 0); значення шуканого елемента.
*/

#include <stdio.h>
#define N 10 //array size

int countNumber(int number, int *, int position);

int main(void)
{
    int array[N] = {1, 2, 3, 1, 4, 5, 1, 6, 1, 0};
    int number = 1;
    int position = 0;
    int count = 0;

    count = countNumber(number, array, position);
    printf("NUMBER %d IS FOUND %d TIMES.\n", number, count);

    return 0;
}

int countNumber(int number, int *array, int position)
{
    while(position < N)
    {
        if( array[position++] == number )
            return 1 + countNumber(number, array, position);
    }
    return 0;
}
