/*----------------------------------------------------------------
 * Алгоритмізація і програмування на мові С.
 * Заняття 9. Типи даних, визначені користувачем (частина 2).
 * Частина 8. Функції зі змінною кількістю параметрів.
 *----------------------------------------------------------------
 * ITA17
 * Vaskivnyuk Mykhailo
 * 16.06.2017
 *----------------------------------------------------------------
 * IDE: Qt Creator 3.2.1 Основан на Qt 5.3.2 (MSVC 2010, 32 бита)
----------------------------------------------------------------*/

/* ЗАВДАННЯ
Реалізуй програму, яка за допомогою функції з різною кількістю параметрів
 поступово заповнює динамічний масив структур:
   - кожна структура має поля:
     name - назва футбольного клубу;
     city - місто, яке представляє клуб;
     place - зайняте місце в чемпіонаті;
     score - кількість набраних очок.
   - оголошується функція inputClub() в трьох варіантах: inputClub(char*, int*),
     inputClub(char*, char*, int*), inputClub(char*, char*, int*, int*);
   - з клавіатури вводиться розмірність масиву N (не менше 5 комірок);
   - під масив динамічно виділяється пам'ять;
   - в першому циклі за допомогою функції inputClub(char*, int*) вводяться назви клубів
     і кількість набраних очок (аргументи функції - адреси полів name i score кожної
     структури динамічного масиву);
   - в другому циклі за допомогою функції inputClub(char*, char*, int*) виводяться на
     екран назви клубів і кількість набраних очок, після чого вводиться назва міста, яке
     представляє клуб (аргументи функції - адреси полів name, city i score
     кожної структури динамічного масиву);
   - в третьому циклі за допомогою функції inputClub(char*, char*, int*, int*) виводяться
     на екран назви клубів, місто і кількість набраних очок, після чого вводиться місце в
     турнірній таблиці, яке повинно відповідати реальному порядковому місцю серед інших клубів
     згідно кількості набраних очок (аргументи функції - адреси всіх полів кожної структури
     динамічного масиву);
   - вивести масив структур на екран, переконатися в коректності його заповнення
     за допомогою реалізованих варіантів однойменних функцій з різною кількістю параметрів.
*/

#include <stdio.h>

typedef
int (*fp)   (            );

int   f1    (            ){ return 5; }
int   f2    (int a       ){ return a; }
int   f3    (int a, int b){ return a + b; }

int  parManyFunc(int, ...);

int main(void)
{
    fp func_ptr = NULL;
//-----------------------------------------------------------------------------
//  тест вказівника на функції з різною кількістю параметрів
//-----------------------------------------------------------------------------
    func_ptr = f1;
    printf("%d\n", func_ptr());
    func_ptr = f2;
    printf("%d\n", func_ptr(10));
    func_ptr = f3;
    printf("%d\n", func_ptr(10, 10));
//-----------------------------------------------------------------------------
//  тест функції з різною кількістю параметрів
//-----------------------------------------------------------------------------
    puts("\0");
    parManyFunc(5, 15, 14, 13, 12, 11);

    func_ptr = parManyFunc;
    puts("\0");
    func_ptr(5, 15, 14, 13, 12, 11);
//-----------------------------------------------------------------------------
    return 0;
}

int parManyFunc(int n, ...)
{
    int * par_ptr = &n;
    int i = 0;

    for(i = 0; i < n; i++)
        printf("%d\n", *++par_ptr);

    return 0;
}
